# Using SQLite with Python

Documentation can be found [here](https://docs.python.org/3/library/sqlite3.html).

In [3]:
import pandas as pd
import sqlite3 as sq

## Some DB basics

SQLite offers persistent storage instead of using RAM, and offers full CRUD support. RAM offers really fast access to data, but as we learnt in the last module, RAM is volatile, so any data disappears at shutdown, and it cannot be accessed by multiple users. SQL still gives fast access to data, but it is stored on the hard drive or external servers; it also allows multiple users to query simultaneously, and and stores data relationally using tables to allow for more efficient storage.

SQL gives us relational databases, as opposed to NoSQL, which is a document-based language. The emphasis is on storing data using keys and values to avoid unnecessarily large data being repeated multiple times in a single column.

## Comparison between Pandas and SQLite

More documentation [here](https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html).

Storing large datasets in csv becomes problematic when manual updates are required, for example updating addresses where a user is listed multiple times. Queries in SQL get around this by systematically editing data based on select parameters, and you can easily store queries that are re-run when triggered.

It is possible to join tables from CSV files based on common values using the `merge` command and the <i>left_on</i>,<i>right_on</i> and <i>how</i> parameters. But SQL allows for relationships between columns that can be referred to when filtering data from different tables, so it's only ever a line of code to do this.


## Creating a SQLite database

In [13]:
# follows this tutorial: https://docs.python.org/3/library/sqlite3.html

# creates a database if it doesn't already exist, if not just connects to the existing file
con = sq.connect("tutorial.db")
# all dbs need a cursor to execute statements and return results
cur = con.cursor()
# execute is an important command, it is how you pass SQL queries to Python
cur.execute("CREATE TABLE name(name text, address text)")
con.commit()

In [19]:
# confirms that table is now in the database
cur.execute("SELECT name FROM sqlite_master")
cur.fetchall()

[('name',)]

In [24]:
# insert data into the table. The triple quotation marks allows you to write multi-line queries for readability.
cur.execute("""
    INSERT INTO name VALUES
        ('aaaaadasl', 'madrid, spain'),
        ('fyhttmnhb', 'porto, portugal'),
        ('ddtgryuymns', 'sofia, bulgaria')
    """)
con.commit()

In [25]:
# confirms that data is now in the database
cur.execute("SELECT * FROM name")
cur.fetchall()

[('ffsjlvdasl', 'cologne, germany'),
 ('fgggggjk', 'town yetholm, scotland'),
 ('dkfkgfkgf', 'limerick, ireland'),
 ('aaaaadasl', 'madrid, spain'),
 ('fyhttmnhb', 'porto, portugal'),
 ('ddtgryuymns', 'sofia, bulgaria')]

In [26]:
# delete some data
cur.execute("DELETE FROM name WHERE name='aaaaadasl'")
con.commit()

In [27]:
# confirms that data is now deleted
cur.execute("SELECT * FROM name")
cur.fetchall()

[('ffsjlvdasl', 'cologne, germany'),
 ('fgggggjk', 'town yetholm, scotland'),
 ('dkfkgfkgf', 'limerick, ireland'),
 ('fyhttmnhb', 'porto, portugal'),
 ('ddtgryuymns', 'sofia, bulgaria')]

In [32]:
# insert lots of items, presumably you can pass csv data through this structure?
data = [
    ("grffdfda","reykjavik, iceland"),
    ("jghuyuyj","brussels, belgium"),
    ("retrtuykjh","accra, ghana"),
]
cur.executemany("INSERT INTO name VALUES(?,?)", data)
con.commit()

In [34]:
# confirms that executemany was successful, uses ROWID to return primary key.
cur.execute("SELECT ROWID, name, address FROM name")
cur.fetchall()

[(1, 'ffsjlvdasl', 'cologne, germany'),
 (2, 'fgggggjk', 'town yetholm, scotland'),
 (3, 'dkfkgfkgf', 'limerick, ireland'),
 (5, 'fyhttmnhb', 'porto, portugal'),
 (6, 'ddtgryuymns', 'sofia, bulgaria'),
 (7, 'grffdfda', 'reykjavik, iceland'),
 (8, 'jghuyuyj', 'brussels, belgium'),
 (9, 'retrtuykjh', 'accra, ghana'),
 (10, 'grffdfda', 'reykjavik, iceland'),
 (11, 'jghuyuyj', 'brussels, belgium'),
 (12, 'retrtuykjh', 'accra, ghana')]

There are a number of duplicates above as I've run the code twice. Some databases wouldn't permit duplicate items but SQLite does, because it uses primary keys to determine whether an item is unique. Just like the other columns, you can use ROWID to specify which items to read, update or delete from the table. When creating a table, you can specify a column to handle the primary key using the command "CREATE TABLE name(id INTEGER PRIMARY KEY," otherwise items will be automatically assigned one by SQLite.

In [ ]:
# importing CSV file

In [ ]:
data = [
    ("grffdfda","reykjavik, iceland"),
    ("jghuyuyj","brussels, belgium"),
    ("retrtuykjh","accra, ghana"),
]
cur.executemany("INSERT INTO name VALUES(?,?)", data)
con.commit()

In [38]:
# delete the original table and confirm that it is gone
cur.execute("DROP TABLE name")
cur.fetchall()

cur.execute("SELECT * from name")
cur.fetchall()

OperationalError: no such table: name

Pandas contains SQL tools, documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html)

In [39]:
# create a variable to store the CSV file, and add it to a new table in the datbase
people = pd.read_csv("name.csv")
people.to_sql("name", con)

104

In [40]:
# confirm that the command ran correctly
cur.execute("SELECT * from name")
cur.fetchall()

[(0, 'ss', 'Cork'),
 (1, 'fh', 'Clare'),
 (2, 'sad', 'Limerick'),
 (3, 'jjhf', 'Kerry'),
 (4, 'hgjkh', 'Waterford'),
 (5, 'faedf a', 'Tipperary'),
 (6, 'jmhhgfs', 'Kilkenny'),
 (7, 'feavyt', 'Carlow'),
 (8, 'jtre', 'Wexford'),
 (9, 'gt', 'Wicklow'),
 (10, 'gfdhy', 'Offaly'),
 (11, 'itr', 'Laois'),
 (12, 'syt', 'Kildare'),
 (13, 'are', 'Longford'),
 (14, 'r7umj', 'Louth'),
 (15, 'rta', 'Meath'),
 (16, 'gvwtd', 'Westmeath'),
 (17, 'uhy', 'Dublin'),
 (18, '5wg4', 'Sligo'),
 (19, 'tw', 'Mayo'),
 (20, 'yhnt', 'Galway'),
 (21, 'rstbgr', 'Leitrim'),
 (22, 'gt', 'Roscommon'),
 (23, 'gnb', 'Donegal'),
 (24, 'are', 'Cavan'),
 (25, 'tn', 'Monaghan'),
 (26, 'gqabr', 'Cork'),
 (27, 'yhnt', 'Clare'),
 (28, 'ren', 'Limerick'),
 (29, 'ythnw', 'Kerry'),
 (30, 't', 'Waterford'),
 (31, 'wuhn', 'Tipperary'),
 (32, 'braen', 'Kilkenny'),
 (33, 'GRRTAE', 'Carlow'),
 (34, 'RR', 'FEW'),
 (35, 'ARA', 'Wicklow'),
 (36, 'SRDTGYH', 'Offaly'),
 (37, 'UJB', 'Laois'),
 (38, 'TVDTAGS', 'Kildare'),
 (39, 'HBTDH', 'Longford'),
 (40, 'dfafgha c', 'Louth'),
 (41, 'GHR', 'Meath'),
 (42, 'GYH', 'Westmeath'),
 (43, 'GREAR', 'Dublin'),
 (44, 'T4WB', 'Sligo'),
 (45, '5YT', 'Mayo'),
 (46, 'A4', 'Galway'),
 (47, '6NJ', 'Leitrim'),
 (48, '7WYN', 'Roscommon'),
 (49, 'BU', 'Donegal'),
 (50, 'HNIMKJN', 'Cavan'),
 (51, 'BG', 'Monaghan'),
 (52, 'TVE', 'Cork'),
 (53, 'SRY', 'Clare'),
 (54, 'BUJEY', 'Limerick'),
 (55, 'VYTA', 'Kerry'),
 (56, ' VTBDYH', 'Waterford'),
 (57, 'MIMKRJGBRE5', 'Tipperary'),
 (58, 'ATEV', 'Kilkenny'),
 (59, 'RBTY', 'Carlow'),
 (60, 'UBEJ', 'Wexford'),
 (61, 'HTRS', 'Wicklow'),
 (62, 'TYHBW', 'Offaly'),
 (63, 'TBN', 'Laois'),
 (64, 'UNHQAB', 'Kildare'),
 (65, '5E5RGT', 'Longford'),
 (66, 'RAERSB', 'Louth'),
 (67, 'DTYU', 'Meath'),
 (68, 'N67', 'Westmeath'),
 (69, 'BYAT', 'Dublin'),
 (70, 'RGSTBHGYNH', 'Sligo'),
 (71, 'IJBHVRSY', 'Mayo'),
 (72, 'BHV5SEBTU', 'Galway'),
 (73, 'JHVST', 'Leitrim'),
 (74, 'BJ N', 'Roscommon'),
 (75, 'STB D', 'Donegal'),
 (76, 'JHGVA', 'Cavan'),
 (77, 'EWATBYSH', 'Monaghan'),
 (78, 'TM', 'Cork'),
 (79, 'SJHGV', 'Clare'),
 (80, 'BDENJMR', 'Limerick'),
 (81, 'SDHNJY ', 'Kerry'),
 (82, 'UKMB', 'Waterford'),
 (83, 'SRNT', 'Tipperary'),
 (84, 'YSHB ', 'Kilkenny'),
 (85, 'RVGDB', 'Carlow'),
 (86, 'TYSHBG', 'Wexford'),
 (87, 'RBDNY', 'Wicklow'),
 (88, 'HBGVR', 'Offaly'),
 (89, 'SYTH ', 'Laois'),
 (90, 'BVRS', 'Kildare'),
 (91, 'BYHBVBTNUJN', 'Longford'),
 (92, 'BVSR', 'Louth'),
 (93, 'BY', 'Meath'),
 (94, 'GHDTN', 'Westmeath'),
 (95, 'UYGSB', 'Dublin'),
 (96, 'S4BEQ', 'Sligo'),
 (97, 'R6YNW', 'Mayo'),
 (98, '5E5RGT', 'Galway'),
 (99, 'SUY', 'Leitrim'),
 (100, 'M6UN', 'Roscommon'),
 (101, 'YIK', 'Donegal'),
 (102, 'JBH', 'Cavan'),
 (103, 'YHWVBARWTaec', 'Monaghan')]

In [41]:
county = pd.read_csv("county.csv")
county.to_sql("county", con)

26

In [47]:
car = pd.read_csv("car.csv")
car.to_sql("car", con)

37

You can then use execute to write custom queries that join or filter tables.

In [50]:
cur.execute("""
    SELECT p.name, c.Reg
    FROM county AS p JOIN car AS c ON p.abb = c.reg_co
""")
cur.fetchall()

[('Cork', '132-C-4305'),
 ('Cork', '202-C-457'),
 ('Cork', '212-C-7519'),
 ('Clare', '192-CE-8263'),
 ('Tipperary', '171-T-241'),
 ('Waterford', '181-W-4696'),
 ('Kerry', '182-KY-6489'),
 ('Limerick', '142-L-5536'),
 ('Limerick', '151-L-872'),
 ('Sligo', '152-SO-5888'),
 ('Roscommon', '222-RN-6530'),
 ('Leitrim', '171-LM-1426'),
 ('Galway', '152-G-2852'),
 ('Galway', '182-G-2026'),
 ('Galway', '211-G-1583'),
 ('Mayo', '172-MO-9629'),
 ('Donegal', '131-DL-8411'),
 ('Cavan', '161-CN-1655'),
 ('Monaghan', '141-MN-8804'),
 ('Louth', '142-LH-3721'),
 ('Longford', '211-LD-1718'),
 ('Meath', '161-MH-6685'),
 ('Westmeath', '221-WH-1255'),
 ('Dublin', '132-D-99329'),
 ('Dublin', '162-D-35699'),
 ('Dublin', '162-D-59846'),
 ('Dublin', '172-D-89331'),
 ('Dublin', '181-D-64784'),
 ('Dublin', '191-D-1018'),
 ('Dublin', '222-D-45442'),
 ('Wicklow', '131-WW-9712'),
 ('Laois', '211-LS-7791'),
 ('Offaly', '212-OY-3674'),
 ('Kildare', '131-KE-5811'),
 ('Kilkenny', '142-KK-5690'),
 ('Carlow', '181-CW-3165'),
 ('Wexford', '132-WX-8325')]

It is good practice to close the connection to the database once you are finished.

In [ ]:
con.close()